Term4/teorver/lectures/8.tex
% Created 2021-04-03 Sat 14:42
% Intended LaTeX compiler: pdflatex

\documentclass[english]{article}
\usepackage[T1, T2A]{fontenc}
\usepackage[lutf8]{luainputenc}
\usepackage[english, russian]{babel}
\usepackage{minted}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{xcolor}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{stmaryrd}
\usepackage{amsmath}
\usepackage{caption}
\usepackage{mathtools}
\usepackage{amsthm}
\usepackage{tikz}
\usepackage{grffile}
\usepackage{extarrows}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage{placeins}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{capt-of}

\usepackage{geometry}
\geometry{a4paper,left=2.5cm,top=2cm,right=2.5cm,bottom=2cm,marginparsep=7pt, marginparwidth=.6in}
 \usepackage{hyperref}
 \hypersetup{
     colorlinks=true,
     linkcolor=blue,
     filecolor=orange,
     citecolor=black,      
     urlcolor=cyan,
     }

\usetikzlibrary{decorations.markings}
\usetikzlibrary{cd}
\usetikzlibrary{patterns}
\usetikzlibrary{automata, arrows}

\newcommand\addtag{\refstepcounter{equation}\tag{\theequation}}
\newcommand{\eqrefoffset}[1]{\addtocounter{equation}{-#1}(\arabic{equation}\addtocounter{equation}{#1})}


\newcommand{\R}{\mathbb{R}}
\renewcommand{\C}{\mathbb{C}}
\newcommand{\N}{\mathbb{N}}
\newcommand{\rank}{\text{rank}}
\newcommand{\const}{\text{const}}
\newcommand{\grad}{\text{grad}}

\newcommand{\todo}{{\color{red}\fbox{\text{Доделать}}}}
\newcommand{\fixme}{{\color{red}\fbox{\text{Исправить}}}}

\newcounter{propertycnt}
\setcounter{propertycnt}{1}
\newcommand{\beginproperty}{\setcounter{propertycnt}{1}}

\theoremstyle{plain}
\newtheorem{propertyinner}{Свойство}
\newenvironment{property}{
  \renewcommand\thepropertyinner{\arabic{propertycnt}}
  \propertyinner
}{\endpropertyinner\stepcounter{propertycnt}}
\newtheorem{axiom}{Аксиома}
\newtheorem{lemma}{Лемма}
\newtheorem{manuallemmainner}{Лемма}
\newenvironment{manuallemma}[1]{%
  \renewcommand\themanuallemmainner{#1}%
  \manuallemmainner
}{\endmanuallemmainner}

\theoremstyle{remark}
\newtheorem*{remark}{Примечание}
\newtheorem*{solution}{Решение}
\newtheorem{corollary}{Следствие}[theorem]
\newtheorem*{examp}{Пример}
\newtheorem*{observation}{Наблюдение}

\theoremstyle{definition}
\newtheorem{task}{Задача}
\newtheorem{theorem}{Теорема}[section]
\newtheorem*{definition}{Определение}
\newtheorem*{symb}{Обозначение}
\newtheorem{manualtheoreminner}{Теорема}
\newenvironment{manualtheorem}[1]{%
  \renewcommand\themanualtheoreminner{#1}%
  \manualtheoreminner
}{\endmanualtheoreminner}
\captionsetup{justification=centering,margin=2cm}
\newenvironment{colored}[1]{\color{#1}}{}

\tikzset{->-/.style={decoration={
  markings,
  mark=at position .5 with {\arrow{>}}},postaction={decorate}}}
\makeatletter
\newcommand*{\relrelbarsep}{.386ex}
\newcommand*{\relrelbar}{%
  \mathrel{%
    \mathpalette\@relrelbar\relrelbarsep
  }%
}
\newcommand*{\@relrelbar}[2]{%
  \raise#2\hbox to 0pt{$\m@th#1\relbar$\hss}%
  \lower#2\hbox{$\m@th#1\relbar$}%
}
\providecommand*{\rightrightarrowsfill@}{%
  \arrowfill@\relrelbar\relrelbar\rightrightarrows
}
\providecommand*{\leftleftarrowsfill@}{%
  \arrowfill@\leftleftarrows\relrelbar\relrelbar
}
\providecommand*{\xrightrightarrows}[2][]{%
  \ext@arrow 0359\rightrightarrowsfill@{#1}{#2}%
}
\providecommand*{\xleftleftarrows}[2][]{%
  \ext@arrow 3095\leftleftarrowsfill@{#1}{#2}%
}
\makeatother
\author{Ilya Yaroshevskiy}
\date{\today}
\title{Лекция 8}
\hypersetup{
 pdfauthor={Ilya Yaroshevskiy},
 pdftitle={Лекция 8},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Стандартное абсолюютно непрерывное распределение}
\label{sec:org83c0a15}
\subsection{Равномерное распределение}
\label{sec:org9b54868}
\begin{definition}
Случайная величина \(\xi\) \textbf{равномерно} распределена на \([a, b]\) если ее плотность постоянна на этом отрезке
\[ f(x) = \begin{cases}
0 & x < a \\
\frac{1}{b - a} & a \le x \le b \\
0 & x > b
\end{cases}\]
\[ F(x) = \int_a^x \frac{1}{b - a}dx = \frac{x - a}{b - a} \]
\[ F(x) = \begin{cases}
0 & x < a \\
\frac{x - a}{b - a} & a \le x \le b \\
1 & x > b
\end{cases} \]
\[ E\xi = \int_{-\infty}^\infty x f(x) dx = \int_a^b x \cdot \frac{1}{b - a} dx = \frac{a + b}{2} \]
\[ E\xi^2 = \int_{-\infty}^\infty x^2f(x) dx = \int_a^b x^2 \frac{dx}{b - a}dx = \frac{a^2 + ab + b^2}{3} \]
\[ D\xi = E\xi^2 - (E\xi)^2 = \frac{a^2 - 2ab + b^2}{12} = \frac{(b - a)^2}{12} \]
\[ \sigma = \frac{b - a}{2\sqrt{3}} \]
\[ p(\alpha < \xi < \beta) = \frac{\beta - \alpha}{b - a} \quad \alpha, \beta \in [a, b] \]
\end{definition}
\begin{symb}
\(\xi \in U_{[a, b]}\)
\end{symb}
\begin{remark}
Датчики случайных чисел имеют равномерное распределение, и с их помощью можно смоделировать другие распределения, если знаем их функции распределения
\end{remark}
\subsection{Экспоненциальное распределение}
\label{sec:org464a9d9}
\begin{definition}
Случайная величина \(\xi\) имеет \textbf{показательное} распределение, если ее плотность имеет вид:
\[ f(x) = \begin{cases}
0 & x < 0 \\
\alpha e^{- \alpha x} & x \ge 0
\end{cases}\]
\[ F(x) = \begin{cases}
0 & x < 0 \\
1 - e^{-\alpha x} & x \ge 0
\end{cases}\]
\[ E\xi^k = \int_{-\infty}^\infty x^k f(x) dx = \int_0^\infty x^k \alpha e^{-\alpha x} dx = \frac{1}{\alpha^k} \int_0^\infty \alpha (\alpha x)^ke^{-\alpha x} dx = \frac{k!}{\alpha^k} \]
\[ E\xi = \frac{1}{\alpha} \]
\[ E\xi^2 = \frac{2}{\alpha^2} \]
\[ D\xi = E\xi^2 - (E\xi)^2 = \frac{1}{\alpha^2} \]
\[ \sigma = \frac{1}{\alpha} \]
\[ p(a < \xi < b) = e^{-a\alpha} - e^{- b\alpha} \]
\end{definition}
\begin{remark}
\textbf{Свойство нестарения}. Если \(\xi \in E_\alpha\), то \(p(\xi > x + y | \xi > x) = p(\xi > y)\)
\end{remark}

\begin{remark}
Гамма функция Эйлера:
\[ \Gamma(\lambda) = \int_0^\infty t^{\lambda - 1} e^{-t} dt \]
\begin{itemize}
\item \[ \Gamma(\lambda - 1) = \lambda! \quad \lambda \in \N \]
\end{itemize}
\end{remark}
\begin{symb}
\(\xi \in E_\alpha\)
\end{symb}
\begin{examp}
Время работы прибора до поломки
\end{examp}
\begin{examp}
Время между появлениями двух соседних редких событий в простейшем потоке событий
\end{examp}
\subsection{Нормальное распределение}
\label{sec:org8b5dcee}
\begin{definition}
Случайная величина \(\xi\) имеет \textbf{нормальное} распределение с параметрами \(a, \sigma > 0\), если ее плотность имеет вид
\[ f(x) = \frac{1}{\sigma\sqrt{2\pi}}e^{-\frac{(x - a)^2}{2\sigma^2}}\]
Смысл параметров распределения: \(a = E\xi\), \(\sigma\) --- среднее квадратическое отклонения. \(D = \sigma^2\) \\
Функция распределения
\[ F(x) = \frac{1}{\sigma\sqrt{2\pi}} \int_{-\infty}^x e^{-\frac{(t - a)^2}{2\sigma^2}} dt \]
\end{definition}
\begin{symb}
\(\xi \in N_{a, \sigma}\)
\end{symb}
\subsection{Стандартное нормальное рапределение}
\label{sec:orgb6b0c1c}
\begin{definition}
Стандартным нормальным распределением называется нормальное распределение с параметрами \(a = 0,\ \sigma = 1\) т.е. \(\xi \in N_{0, 1}\). Плотность
\[ \varphi(x) = \frac{1{\sqrt{2\pi}}}e^{-\frac{x^2}{2}} \]
Функиця распределения
\[ \Phi_0(x) = \frac{1}{\sqrt{2\pi}}\int_{-\infty}^x e^{-\frac{z^2}{2}} dz \]
\end{definition}
\begin{remark}
\[ \Phi_0(x) = \frac{1}{\sqrt{2\pi}}\int_{-\infty}^0 e^{-\frac{z^2}{2}} dz + \frac{1}{\sqrt{2\pi}} \int_0^x e^{-\frac{z^2}{2}} dz = 0.5 + \Phi(x)\text{ --- функция Лапласса} \]
\end{remark}
\begin{remark}
Интеграл Пуассона
\[ \int_{-\infty}^\infty e^{-\frac{x^2}{2}} dx = \sqrt{2\pi} \]
\end{remark}
\subsection{Связь между нормальным и стандартным нормальным распределениями и ее следствия}
\label{sec:orgecb8f0b}
\begin{property}
\(\xi \in N_{a, \sigma}\). Тогда
\[ F_\xi(x) = \Phi_\xi \left(\frac{x -a}{\sigma}\right) \]
\end{property}
\begin{proof}
\[ F_\xi(x) = \frac{1}{\sigma\sqrt{2\pi}} \int_{-\infty}^\infty e^{-\frac{(t - a)^2}{2\sigma^2}} dt \]
\todo
\end{proof}
\begin{property}
Если \(\xi \in N_{a,\sigma}\), тогда \(\eta = \frac{1 - a}{\sigma} \in N_{0, 1}\)
\end{property}
\begin{proof}
\todo
\end{proof}
\begin{property}
\(\xi \in N_{a, \sigma}\). Тогда \(E\xi = a\), \(D\xi = \sigma^2\)
\end{property}
\begin{proof}
\[ \eta = \frac{\xi - a}{\sigma} \in N_{0, 1} \Rightarrow E\eta = 0,\ D\eta = 1\]
\[ \xi = \sigma\eta + a \]
\[ E\xi = \sigma\cdot 0 + a = a \]
\[ D\xi = \sigma^2 \cdot 1 = \sigma^2 \]
\end{proof}

\begin{property}
Вероятность попадания случайной величины в заданый интервал
\[ p(\alpha < \xi < \beta)  = \Phi \left(\frac{\beta - a}{\sigma}\right) - \Phi \left(\frac{\alpha - a}{\sigma}\right) \]
\end{property}
\begin{proof}
\[ p(\alpha < \xi < \beta) = F_\xi(\beta) - F_\xi(\alpha) = \Phi_0 \left(\frac{\beta - a}{\sigma}\right) - \Phi_0 \left(\frac{\alpha - a}{\sigma}\right) = \]
\[ = \left(0,5 + \Phi \left(\frac{\beta - a}{\sigma}\right)\right) - \left(0,5 + \Phi \left(\frac{\alpha - a}{\sigma}\right)\right) = \Phi \left(\frac{\beta - a}{\sigma}\right) - \Phi \left(\frac{\alpha - a}{\sigma}\right) \]
\end{proof}
\begin{property}
Вероятность отклонения случайной величины от ее среднего значения или попадание в интервал симметричный относительно \(a\)
\[ p(|\xi - a| < t) = 2\Phi \left(\frac{t}{\sigma}\right) \]
\end{property}
\begin{proof}
\[ P(|\xi - a| < t) = p(-t < \xi - a < t) = p(a - t < \xi a + t) = \Phi \left(\frac{a + t - a}{\sigma}\right) - \Phi \left(\frac{a - t - a}{\sigma}\right) = \]
\[ = \Phi \left(\frac{t}{\sigma}\right) - \Phi \left(-\frac{t}{\sigma}\right) = 2\Phi \left(\frac{t}{\sigma}\right) \]
\end{proof}
\begin{proof}
При замене в этой формуле \(Phi(x)\) на \(\Phi_0(x)\) получится
\[ p(|\xi - a| < t) = 2\Phi_0 \left(\frac{t}{\sigma}\right) - 1 \]
\end{proof}
\begin{property}[Правило трех \(\sigma\)]
\[ p(|\xi - a| < 3\sigma) \approx 0.9973 \]
\end{property}
\subsection{Коэффиценты асимметрии и эксцесса}
\label{sec:orgcad1259}
\begin{definition}
Асимметрией распределения называется число
\[ A_\xi = E \left(\frac{\xi - a}{\sigma}\right)^3 = \frac{N_{a, \sigma}}{\sigma^3} \fixme\]
\end{definition}
\begin{definition}
Эксцессом распределения называется число
\[ E_\xi = E \left(\frac{\xi - a}{\sigma}\right)^4 - 3 = \frac{N_{a,\sigma}}{\sigma^4} - 3 \fixme \]
\end{definition}
\begin{remark}
Если \(\xi \in N_{a,\sigma^2}\), то \(A\xi = 0\) и \(E\xi = 0\). Таким образом эти коэффиценты показывают насколько сильно данное распределение отличается от нормального
\end{remark}
\subsection{Гамма функция и гамма распределение}
\label{sec:org64043c6}
\begin{definition}
Гамма функцией Гаусса называется функия
\[ \Gamma(\lambda) = \int_0^\infty t^{\lambda - 1} e^{-t}dt \]
\end{definition}
\beginproperty
\begin{property}
\[ \Gamma(\lambda) = (\lambda - 1)\cdot \Gamma(\lambda - 1) \]
\end{property}
\begin{property}
\[ \Gamma(1) = 1 \]
\end{property}
\begin{property}
\[ \Gamma(x) = (x - 1)!\quad x \in \N \]
\end{property}
\begin{property}
\[ \Gamma(\frac{1}{2}) = \sqrt{\pi} \]
\end{property}
\begin{definition}
Случайная величина \(\xi\) имеет гамма распределение с параметрами \(\alpha, \lambda > 0\), если ее плотность имеет вид:
\[ f_\xi (x) = \begin{cases}
0 & x < 0 \\
\frac{\alpha^\lambda}{\Gamma(\lambda)}x^{\lambda - 1}e^{-\alpha x} & x \ge 0
\end{cases} \fixme \] 
\[ F_\xi(x) = \frac{\alpha^\lambda}{\Gamma(\lambda)} \int_0^x t^{\lambda - 1} e^{-\alpha t} dt \quad x \ge 0 \]
Если \(\lambda \in \N\), то \[F_\xi(x) = \sum_{k = \lambda}^\infty \frac{(\alpha x)^k}{x^k}e^{-\alpha x} \fixme \]
\end{definition}
\begin{symb}
\(\xi \in \Gamma_{\alpha, \lambda}\)
\end{symb}
\beginproperty
\begin{property}
\(E\xi = \frac{\lambda}{\alpha}\), \(D\xi = \frac{\lambda}{\alpha^2}\)
\end{property}
\begin{property}
\(\Gamma_{\alpha, \lambda} = E_\alpha\)
\end{property}
\begin{property}
\todo
\end{property}
\begin{property}
Если \(\xi \in N_{0, 1}\), то \(\xi^2 \in \Gamma_{\frac{1}{2},\frac{1}{2}}\)
\end{property}
\end{document}
